import java.util.HashMap;
import java.util.Map;

public class Information {
    public static final String[] lessons = {
            "ریاضی 1",
            "ریاضی 2",
            "فیزیک 1",
            "فیزیک 2",
            "گسسته",
            "آمار و احتمال مهندسی",
            "مبانی برنامه نویسی",
            "برنامه سازی پیشرفته",
            "مدارمنطقی",
            "زبان تخصصی",
            "زبان عمومی",
            "حل تمرین فیزیک 1",
            "حل تمرین فیزیک 2",
            "حل تمرین ریاضی 1",
            "حل تمرین ریاضی 2",
            "ازمایشگاه فیزیک",
            "کارگاه کامپیوتر",
            "معماری کامپیوتر",
            "ساختمان داده",
            "پایگاه داده",
            "معادلات دیفرانسیل",
            "شبیه سازی کامپیوتری",
            "نظریه زبان ها و ماشین ها",
            "سیستم عامل",
            "شبکه های کامپیوتری",
            "کامپایلر",
            "وصایای امام",
            "ادبیات فارسی",
            "اندیشه اسلامی"
    };
    public static final String[][] coRequisites = {
            {"ریاضی 1","حل تمرین ریاضی 1"},
            {"ریاضی 2","حل تمرین ریاضی 2","معادلات دیفرانسیل"},
            {"فیزیک 1","حل تمرین فیزیک 1"},
            {"فیزیک 2","حل تمرین فیزیک 2","ازمایشگاه فیزیک"},
            {"آمار و احتمال مهندسی","گسسته","مدارمنطقی"},
            {"مبانی برنامه نویسی","کارگاه کامپیوتر"},
            {"برنامه سازی پیشرفته","معماری کامپیوتر",},
    };
    public static Map<String,String[]> preRequisites(){
        Map<String,String[]> preRequisites = new HashMap<>();

        preRequisites.put(
                "ریاضی 2",
                new String[] {"ریاضی 1"}
        );
        preRequisites.put(
                "فیزیک 2",
                new String[] {"ریاضی 1","فیزیک 1"}
        );
        preRequisites.put(
                "برنامه سازی پیشرفته",
                new String[] {"ریاضی 1","مبانی برنامه نویسی"}
        );
        preRequisites.put(
                "کامپایلر",
                new String[] {"زبان تخصصی","ریاضی 1","برنامه سازی پیشرفته"}
        );
        preRequisites.put(
                "سیستم عامل",
                new String[] {"برنامه سازی پیشرفته","ساختمان داده"}
        );
        preRequisites.put(
                "پایگاه داده",
                new String[] {"برنامه سازی پیشرفته","ساختمان داده"}
        );
        preRequisites.put(
                "شبکه های کامپیوتری",
                new String[] {"برنامه سازی پیشرفته","ساختمان داده","گسسته"}
        );
        return preRequisites;
    }
}
